define(
    [
        'data'
    ],
    function(data)
    {
        var fields = _.assign(_.clone(data.fieldById), {
            "1003": {
                "name": "TradeID 交易所成交申报编号",
                "type": "C16"
            },
            "1090": {
                "name": "MaxPriceLevels 最多成交价位数",
                "type": "N4"
            },
            "1091": {
                "name": "PreTradeAnonymity 是否匿名",
                "type": "N1",
                "values": {
                    "0": "显名",
                    "1": "匿名"
                }
            },
            "1093": {
                "name": "LotType 订单数量类型",
                "type": "C1",
                "values": {
                    "1": "零股订单，Odd Lot",
                    "2": "整手订单，Round Lot"
                }
            },
            "1116": {
                "name": "NoRootPartyIDs 参与人代码个数",
                "type": "NumInGroup"
            },
            "1117": {
                "name": "RootPartyID 参与人代码",
                "type": "STRING"
            },
            "1118": {
                "name": "RootPartyIDSource 参与人代码源",
                "type": "STRING"
            },
            "1119": {
                "name": "RootPartyRole 参与人代码角色",
                "type": "STRING"
            },
            "1123": {
                "name": "TradeHandlingInstr 成交申报模式",
                "type": "C1",
                "values": {
                    "0": "Trade Confirm，成交确认",
                    "1": "Two-Party Report，成交报告",
                    "2": "One-Party Report for Matching，协议配对",
                    "3": "One-Party Report for Pass Through，成交请求",
                    "5": "Two Party Report for Claim，双边确认成交报告"
                }
            },
            "1125": {
                "name": "OrigTradeDate 初始成交申报申报日期",
                "type": "LocalMktDate"
            },
            "1126": {
                "name": "OrigTradeID 初始成交申报的TradeID",
                "type": "C16"
            },
            "1166": {
                "name": "QuoteMsgID 客户报价消息编号",
                "type": "C10"
            },
            "1171": {
                "name": "PrivateQuote 私有报价",
                "type": "N1",
                "values": {
                    "0": "私有报价（Private Quote）",
                    "1": "公开报价（Public Quote）"
                }
            },
            "1180": {
                "name": "ApplID 应用标识",
                "type": "C3",
                "values": {
                    "010": "现货（股票，基金，债券等）集中竞价交易订单申报",
                    "020": "债券通用质押式回购交易订单申报",
                    "030": "债券分销订单申报",
                    "040": "期权集中竞价交易订单申报",
                    "041": "期权集中竞价交易报价申报",
                    "042": "期权集中竞价交易询价申报",
                    "050": "协议交易意向申报",
                    "051": "协议交易定价申报",
                    "052": "协议交易点击成交申报",
                    "053": "协议交易双方配对成交申报",
                    "055": "协议交易询价请求申报",
                    "056": "协议交易报价申报",
                    "057": "协议交易报价回复申报",
                    "060": "以收盘价交易的盘后定价大宗交易申报",
                    "061": "以成交量加权平均价交易的盘后定价大宗交易申报",
                    "070": "转融通证券出借非约定申报",
                    "071": "转融通证券出借约定申报",
                    "080": "资产管理计划份额转让",
                    "090": "股票质押式回购",
                    "100": "约定购回",
                    "110": "质押式报价回购",
                    "120": "ETF实时申购赎回申报",
                    "130": "网上发行认购申报",
                    "140": "配股认购申报",
                    "150": "债券转股申报",
                    "151": "债券回售申报",
                    "152": "债券回售撤销申报",
                    "160": "期权行权申报",
                    "161": "期权行权指令合并申报",
                    "170": "开放式基金申购赎回申报",
                    "180": "要约收购预受要约申报",
                    "181": "要约收购解除预受要约申报",
                    "190": "通用质押式回购质押申报",
                    "191": "通用质押式回购解押申报",
                    "200": "转托管申报",
                    "210": "网络投票申报",
                    "220": "黄金ETF实物申购赎回申报",
                    "230": "权证行权申报",
                    "240": "密码服务激活申报",
                    "241": "密码服务挂失申报",
                    "250": "保证金查询",
                    "270": "转处置扣券申报",
                    "271": "转处置还券申报",
                    "280": "垫券申报",
                    "281": "还券申报",
                    "290": "待清偿扣划客户申报",
                    "291": "待清偿扣划自营申报",
                    "300": "债券质押式协议回购申报",
                    "310": "分级基金实时分拆申报",
                    "311": "分级基金实时合并申报",
                    "630": "港股通申报",
                    "320": "债券质押式三方回购交易申报",
                    "330": "债券质押式三方回购入库申报",
                    "331": "债券质押式三方回购出库申报",
                    "340": "期权组合策略保证金构建组合申报",
                    "341": "期权组合策略保证金解除组合申报",
                    "350": "期权普通转备兑仓申报",
                    "351": "期权备兑转普通仓申报",
                    "370": "盘后定价交易订单申报",
                    "410": "债券现券交易匹配成交申报",
                    "411": "债券现券交易协商成交申报",
                    "412": "债券现券交易点击成交报价申报",
                    "413": "债券现券交易点击成交报价回复申报",
                    "414": "债券现券交易询价申报",
                    "415": "债券现券交易询价成交报价申报",
                    "416": "债券现券交易询价成交报价回复申报"
                }
            },
            "1328": {
                "name": "RejectText 拒绝原因说明",
                "type": "C16"
            },
            "8502": {
                "name": "DesignationInstruction 注册指令",
                "type": "C1"
            },
            "8527": {
                "name": "DesignationTransType 注册指令类型",
                "type": "N1",
                "values": {
                    "1": "New，表示新注册请求",
                    "3": "Cancel，表示注册撤单"
                }
            },
            "8529": {
                "name": "VotingProposal 投票议案号",
                "type": "N4",
                "values": {
                    "1": "99表示具体议案号",
                },
            },
            "8530": {
                "name": "VotingSubProposal 投票子议案号或选举候选人",
                "type": "N4"
            },
            "8531": {
                "name": "VotingPreference 投票意向",
                "type": "C1"
            },
            "8539": {
                "name": "ValidationCode 密码激活校验号",
                "type": "N9"
            },
            "8902": {
                "name": "NoSecurity 证券只数",
                "type": "NumInGroup"
            },
            "8903": {
                "name": "DeliverQty 证券交付数量",
                "type": "Qty"
            },
            "8904": {
                "name": "SubstCash 现金替代金额",
                "type": "Amt"
            },
            "8906": {
                "name": "ExpirationType 期限类型",
                "type": "N2"
            },
            "8907": {
                "name": "ExpirationExecInst 到期续做方式",
                "type": "N2"
            },
            "8908": {
                "name": "ShareProperty 股份性质",
                "type": "C2",
                "values": {
                    "00": "无限售流通股",
                    "01": "首发后限售股",
                    "05": "首发前限售股",
                    "07": "首发后可出借限售股"
                }
            },
            "8909": {
                "name": "BidPositionEffect 买开平仓标志",
                "type": "C1"
            },
            "8910": {
                "name": "OfferPositionEffect 卖开平仓标志",
                "type": "C1"
            },
            "8911": {
                "name": "ExpirationDays 期限（天）",
                "type": "N4"
            },
            "8912": {
                "name": "TrdAckStatus 成交申报响应状态",
                "type": "C1",
                "values": {
                    "0": "Accepted，接受",
                    "1": "Rejected，拒绝"
                }
            },
            "10179": {
                "name": "ReportIndex 回报记录号",
                "type": "SeqNum"
            },
            "10180": {
                "name": "PlatformID 平台号",
                "type": "N4",
                "values": {
                    "1": "现货集中竞价交易平台",
                    "2": "综合金融服务平台",
                    "3": "非交易处理平台",
                    "4": "衍生品集中竞价交易平台",
                    "5": "国际市场互联平台",
                    "6": "固定收益交易平台"
                }
            },
            "10181": {
                "name": "PlatformStatus 平台状态",
                "type": "N4",
                "values": {
                    "0": "PreOpen，未开放",
                    "1": "OpenUpComing，即将开放",
                    "2": "Open，开放",
                    "3": "Halt，暂停开放",
                    "4": "Close，关闭"
                }
            },
            "10182": {
                "name": "OrigTradeReportID 初始交易客户成交申报编号",
                "type": "C10"
            },
            "10183": {
                "name": "PledgeeType 质权人类型",
                "type": "N2"
            },
            "10184": {
                "name": "Contactor 联系人",
                "type": "C12"
            },
            "10185": {
                "name": "ContactInfo 联系方式",
                "type": "C30"
            },
            "10186": {
                "name": "NoMarginItems 保证金条目个数",
                "type": "NumInGroup"
            },
            "10187": {
                "name": "MarginItem 保证金条目类别",
                "type": "N2",
                "values": {
                    "1": "保证金可用余额",
                    "2": "保证金总金额"
                }
            },
            "10188": {
                "name": "MarginAmount 保证金金额",
                "type": "Amt"
            },
            "10189": {
                "name": "IMCRejectText 国际市场互联对方市场拒绝原因说明",
                "type": "C150"
            },
            "10190": {
                "name": "InvestmentType 资金用途类型",
                "type": "C2",
                "values": {
                    "01": "生产经营",
                    "02": "补充流动资金",
                    "03": "股权类投资",
                    "04": "债权类投资",
                    "05": "不动产投资",
                    "06": "偿还债务",
                    "07": "个人消费",
                    "99": "其他"
                }
            },
            "10191": {
                "name": "AlertRatio 预警线（百分比）",
                "type": "N6(2)"
            },
            "10192": {
                "name": "SettlementRatio 平仓线（百分比）",
                "type": "N6(2)"
            },
            "10193": {
                "name": "NoBaskets 质押篮子个数",
                "type": "NumInGroup"
            },
            "10194": {
                "name": "BasketID 篮子编号",
                "type": "N2"
            },
            "10195": {
                "name": "DeliverySide 方向",
                "type": "C1",
                "values": {
                    "1": "质押",
                    "2": "解押"
                }
            },
            "10196": {
                "name": "NoPartitions 平台分区数量",
                "type": "NumInGroup"
            },
            "10197": {
                "name": "PartitionNo 平台分区号",
                "type": "N9"
            },
            "10198": {
                "name": "Memo 备注",
                "type": "C160"
            },
            "10199": {
                "name": "NoQuote 报价消息个数",
                "type": "NumInGroup"
            },
            "10200": {
                "name": "QuoteRequestTransType 询价请求事务类型",
                "type": "N2",
                "values": {
                    "0": "New，新订单",
                    "1": "Cancel，撤销"
                }
            },
            "10206": {
                "name": "UnderlyingShareProperty 基础证券股份性质",
                "type": "C2",
                "values": {
                    "00": "无限售流通股",
                    "01": "首发后限售股"
                }
            },
            "10216": {
                "name": "SettlPeriod 结算周期",
                "type": "N2",
                "values": {
                    "0": "T+0",
                    "1": "T+1",
                    "2": "T+2",
                    "3": "T+3"
                }
            },
            "10222": {
                "name": "QuoteRequestStatus 询价请求状态",
                "type": "N3",
                "values": {
                    "0": "Accepted，已接受",
                    "4": "Cancelled，已撤销",
                    "5": "Rejected，已拒绝",
                    "7": "Expired，已超时",
                    "8": "Filled，已成交"
                }
            },
            "10223": {
                "name": "NoCounterpartyPBU 对手方交易单元个数 ",
                "type": "NumInGroup"
            },
            "10224": {
                "name": "CounterpartyPBUID 对手方交易单元",
                "type": "C6"
            },
            "10225": {
                "name": "QuotePrice 报价价格",
                "type": "Price"
            },
            "10226": {
                "name": "QuoteQty 报价数量",
                "type": "Qty"
            },
            "10232": {
                "name": "NoCounterInfos 对手方交易主体个数",
                "type": "NumInGroup"
            }
        });

        // MsgType，消息类型
        _.assign(fields["35"]["values"], {
            "U001": "Designation，注册（转托管）",
            "U004": "EVote，网络投票",
            "U006": "Password Service，密码服务",
            "U008": "Margin Query，保证金查询"
        });

        // BusinessRejectReason，业务拒绝原因
        _.assign(fields["380"]["values"], {
            "20001": "无效账户，账户为未开户账户",
            "20002": "无效账户，账户是一个无效账户（已注销、挂失等等）",
            "20003": "无效账户，账户无对应业务产品的交易权限",
            "20005": "业务禁止，证券的业务开关关闭",
            "20006": "业务禁止，当前阶段不允许申报该类委托",
            "20007": "证券停牌，证券停牌，不允许该类申报委托",
            "20008": "价格错误，委托价格不是价格档位的整数倍",
            "20009": "价格错误，委托价格超过涨跌幅限制",
            "20010": "数量非法，委托数量不是数量单位的整数倍",
            "20011": "量额非法，委托数量和金额都未满足最低交易门槛要求",
            "20012": "业务禁止，对折算率为0的证券不允许申报质押式回购质押申报",
            "20013": "业务禁止，融资融券标的不存在或业务被禁止",
            "20014": "业务禁止，证券当天集中竞价没有成交，不能申报以成交量加权平均价交易的委托",
            "20015": "业务禁止，融券卖出禁止申报市价委托",
            "20016": "价格错误，融券卖出委托价格不满足提价检查要求",
            "20017": "无效账户，信用账户只能买入担保品证券",
            "20018": "无效账户，非信用账户申报融资融券委托",
            "20019": "无效单元，卖委托的交易单元非承销商交易单元",
            "20020": "无效账户，卖委托的证券账户非承销商证券账户或者买委托的证券账户为承销商证券账户",
            "20021": "数量超限，自行挂牌量超出自行挂牌总量",
            "20022": "股份卖空，持有股份不足",
            "20023": "无效单元，委托的交易单元不存在",
            "20024": "无效单元，委托的交易单元无对应产品的交易权限",
            "20025": "无效单元，委托的交易单元无对应业务的交易权限",
            "20026": "无效单元，信用账户必须通过信用交易单元申报",
            "20027": "无效单元，QFII账户未从指定交易单元申报",
            "20028": "无效单元，交易单元无对应产品的业务权限",
            "20029": "业务禁止，市场参与者业务资格被限制",
            "20030": "约定号重，协议交易成交申报约定号重复",
            "20031": "配对失败，交易双方申报要素不匹配",
            "20032": "配对失败，B股协议交易境内账户和境外账户不能成交",
            "20033": "无对手方，协议交易点击成交申报约定号错误",
            "20034": "金额非法，委托中的金额必须为金额单位的整数倍",
            "20035": "申购不足，申购ETF时投资者成份股不足",
            "20036": "赎回不足，赎回ETF时基金公司成份股不足",
            "20037": "现金超限，现金替代部分超过上限",
            "20038": "无效账户，合约账户标识码与申报交易单元对应的结算账号不一致",
            "20039": "重复申报，网上发行重复认购",
            "20040": "无效单元，非证券金融公司专用交易单元申报借入委托",
            "20041": "股份卖空，解押业务中对应的已质押股份不足",
            "20042": "股份卖空，解押业务中对应的标准券不足",
            "20046": "无法成交，市价委托不满足成交条件撤单",
            "20047": "规模超限，基金累计申购或赎回总规模超限",
            "20048": "规模超限，单个账户基金累计申购或赎回规模超限",
            "20049": "规模超限，基金净申购或净赎回总规模超限",
            "20050": "规模超限，单个账户基金净申购或净赎回规模超限",
            "20051": "购回期限错误，回购天数超过业务限制",
            "20055": "无效会员，会员无对应业务的交易权限",
            "20056": "无效账户，非业务指定交易的证券账户",
            "20059": "金额超限，当日净买入金额超出设定限额",
            "20060": "仓位不足，期权平仓检查时，可平数量不足",
            "20061": "交易量超限，超过投资者交易量限额",
            "20062": "持仓超限，超过结算参与人持仓限额",
            "20063": "持仓超限，超过投资者持仓限额",
            "20064": "资金不足，结算参与人可用资金不足",
            "20065": "平台已关闭，平台已关闭",
            "20067": "备兑标签错，备兑标签错误",
            "20068": "结算机构错，结算机构代码错误",
            "20069": "无效账户，委托中的账户为结算受限账户",
            "20070": "无效账户，委托中的账户为不合格账户",
            "20071": "OwnerType错误，强平主动撤单的OwnerType必须与原委托的一致",
            "20073": "报价错误，双边报价申报的买价必须低于卖价",
            "20074": "无效业务，强平委托必须是限价委托",
            "20075": "报价撤销，报价被更新或撤销",
            "20076": "申报方式错误，竞价委托申报方式错误",
            "20077": "无报价权限，无做市报价权限",
            "20078": "交易量超限，超过结算参与人交易量限额",
            "20079": "减持额度不足，受限股份减持，可用额度不足",
            "20095": "撤单请求错误，主动撤单请求的applid或证券id与原委托的不一致",
            "20096": "无法撤销，主动撤单请求目标委托不能被撤销",
            "20097": "委托不存在，主动撤单未找到原始委托或者没有可以被撤销的报价",
            "20099": "重单，重单",
            "20101": "应用标识错，应用标识错误",
            "20102": "证券非法，证券不支持所申报的业务",
            "20103": "解包失败，解包失败",
            "20104": "平台未开放，平台未开放",
            "20105": "交易单元错，网关对交易单元无权限",
            "20106": "字段错误，字段取值错误",
            "20107": "消息类型非法，不支持的消息类型",
            "20108": "平台非法，委托申报的平台错误，例如向现货集中竞价平台申报发行认购业务的委托",
            "20110": "价格类型错，价格类型错误",
            "20111": "无效单元，成交申报中的多方交易单元不属于同一会员",
            "20112": "无权限，网关无申报委托权限",
            "20113": "服务暂停，资金查询服务暂停",
            "20114": "临时停市拒绝，临时停市拒绝",
            "20115": "申报方式错误，成交申报报文TradeHandlingInstr、TradeReportTransType、TradeReportType字段组合不合法",
            "20116": "申报方式错误，成交请求发起方错误",
            "20117": "无效账户，证券账户无三方回购业务的正/逆回购权限",
            "20118": "篮子非法，三方回购申报的篮子个数超限",
            "20119": "质押券非法，质押券或交付债券个数不符合业务要求",
            "20120": "质押券非法，质押券不在协议回购业务允许的质押券范围内",
            "20121": "质押券非法，质押券全天停牌",
            "20122": "质押券非法，换出证券不在其对应的在途合约质押券列表中",
            "20123": "无效单元，成交申报中的对手方交易单元不存在",
            "20124": "回购期限错误，指定质押券的到期日小于合约到期日",
            "20125": "合约不存在，对应合约不存在",
            "20126": "业务禁止，协议回购、三方回购的到期购回、到期续做委托对应的在途合约不是当日到期合约",
            "20127": "业务禁止，委托申报单元、证券账户、交易商代码、交易主体代码、交易主体类型与对应合约不一致",
            "20128": "金额非法，三方回购到期续做金额超过原合约金额",
            "20129": "证券非法，三方回购入库证券不在质押券篮子清单范围内",
            "20130": "无对手方，成交请求模式下确认方发起的委托未找到提交方申报的委托",
            "20131": "业务禁止，协议回购、三方回购在途合约当前状态不允许申报该类别委托",
            "20132": "业务禁止，期权构建组合或行权指令合并申报时，合约的标的、合约单位、到期日不符规则",
            "20133": "业务禁止，成份合约已过组合自动解除日",
            "20134": "业务禁止，合约不支持申报的策略",
            "20135": "业务禁止，期权构建组合或行权指令合并申报时，委托成份合约个数不符规则",
            "20136": "数量非法，委托成份合约数量不符规则",
            "20137": "业务禁止，委托成份合约权利仓/义务仓不符规则",
            "20138": "业务禁止，期权构建组合或行权指令合并申报时，委托成份合约认购/认沽不符规则",
            "20139": "业务禁止，期权构建组合或行权指令合并申报时，委托成份合约行权价不符规则",
            "20140": "业务禁止，解除组合，申报的组合流水号对应组合策略持仓的参与人信息与委托中的不一致",
            "20143": "无效交易主体，交易商未报备申报的交易主体代码、交易主体类型",
            "20144": "无效交易员，交易商未报备申报的交易员代码",
            "20145": "无效账户，证券账户在交易商已报备的交易主体账户列表中不存在",
            "20146": "订单已超时，订单已超时",
            "20147": "询价交易ID重复，询价请求QuoteReqID、报价QuoteID、报价回复QuoteRespID重复",
            "20201": "议案代码错，议案号和子议案号错误",
            "20202": "表决意见错，投票意向错误",
            "29995": "市场互联拒绝，港股通撤单请求被联交所拒绝",
            "29996": "市场互联拒绝，港股通委托被联交所自动撤销",
            "29997": "市场互联拒绝，港股通委托被联交所拒绝",
            "29998": "市场互联拒绝，港股通委托被联交所拒绝",
            "29999": "其他错误"
        });

        // PartyRole，参与人代码角色
        _.assign(fields["452"]["values"], {
            "4001": "营业部代码",
            "4002": "对手方营业部代码",
            "4003": "交易主体代码",
            "4004": "对手方交易主体代码",
            "4005": "申报方交易主体代码"
        });

        // TrdType，成交申报类型
        _.assign(fields["828"]["values"], {
            "1001": "股票质押式回购初始交易",
            "1002": "股票质押式回购提前购回",
            "1003": "股票质押式回购到期购回",
            "1004": "股票质押式回购延期购回",
            "1005": "股票质押式回购终止购回",
            "1006": "股票质押式回购补充质押",
            "1007": "股票质押式回购部分解除质押",
            "1008": "股票质押式回购违约处置",
            "1009": "股票质押式回购部分购回",
            "1010": "股票质押式回购违约处置撤销",
            "1011": "约定购回初始交易",
            "1012": "约定购回提前购回",
            "1013": "约定购回到期购回",
            "1014": "约定购回延期购回",
            "1021": "质押式报价回购初始交易",
            "1022": "质押式报价回购提前购回",
            "1031": "债券质押式协议回购初始交易",
            "1032": "债券质押式协议回购到期购回",
            "1033": "债券质押式协议回购到期续做",
            "1034": "债券质押式协议回购提前购回",
            "1035": "债券质押式协议回购解除质押",
            "1036": "债券质押式协议回购质押券变更",
            "1041": "债券质押式三方回购初始交易",
            "1042": "债券质押式三方回购到期购回",
            "1043": "债券质押式三方回购到期续做",
            "1044": "债券质押式三方回购提前购回",
            "1045": "债券质押式三方回购补券",
            "1046": "债券质押式三方回购换券",
            "1047": "债券质押式三方回购解除质押"
        });

        return {
            systemFieldIds: data.systemFieldIds,
            fieldById: fields
        };
    }
);

